{"attributes":{"allowNoIndex":true,"timeFieldName":"@timestamp","title":"logs-*"},"coreMigrationVersion":"8.8.0","created_at":"2025-05-09T16:55:46.062Z","created_by":"u_mGBROF_q5bmFCATbLXAcCwKa0k8JvONAwSruelyKA5E_0","id":"logs-*","managed":true,"references":[],"type":"index-pattern","typeMigrationVersion":"8.0.0","updated_at":"2025-05-09T16:55:46.062Z","updated_by":"u_mGBROF_q5bmFCATbLXAcCwKa0k8JvONAwSruelyKA5E_0","version":"WzMwNzcsNDNd"}
{"attributes":{"controlGroupInput":{"chainingSystem":"HIERARCHICAL","controlStyle":"oneLine","ignoreParentSettingsJSON":"{\"ignoreFilters\":false,\"ignoreQuery\":false,\"ignoreTimerange\":false,\"ignoreValidations\":false}","panelsJSON":"{}","showApplySelections":false},"description":"","kibanaSavedObjectMeta":{"searchSourceJSON":"{\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filter\":[]}"},"optionsJSON":"{\"useMargins\":true,\"syncColors\":false,\"syncCursor\":true,\"syncTooltips\":false,\"hidePanelTitles\":false}","panelsJSON":"[{\"type\":\"lens\",\"title\":\"LIVE EVENTS\",\"embeddableConfig\":{\"attributes\":{\"title\":\"Table @timestamp & agent.ephemeral_id & agent.id & agent.name & agent.name.text\",\"references\":[],\"state\":{\"datasourceStates\":{\"textBased\":{\"layers\":{\"c5c9ef16-a818-45b2-a4ed-aa757fae5c5d\":{\"index\":\"1c4eead0a28b72819bd16e7da543f189ff498e9a967807a8cd96f7cbf8090fe9\",\"query\":{\"esql\":\"FROM logs-keycloak.log-default | WHERE keycloak.event_type LIKE \\\"login\\\" and keycloak.login.type != \\\"CODE_TO_TOKEN\\\" | KEEP *\"},\"columns\":[{\"columnId\":\"@timestamp\",\"fieldName\":\"@timestamp\",\"meta\":{\"type\":\"date\",\"esType\":\"date\"},\"inMetricDimension\":true},{\"columnId\":\"4ba25b75-4b89-4e13-b809-24b568acf993\",\"fieldName\":\"keycloak.login.type\",\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}},{\"columnId\":\"defe418a-b820-4218-9a92-a4d6c16d8c02\",\"fieldName\":\"host.name\",\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}},{\"columnId\":\"baec0fb5-9ad5-424b-88de-0a5d8095ded9\",\"fieldName\":\"host.os.name\",\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}},{\"columnId\":\"34a9ad1f-14de-45b3-acc5-13767b64864f\",\"fieldName\":\"host.os.version\",\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}},{\"columnId\":\"de144cd1-e33f-4814-8ede-d2558b81aeaf\",\"fieldName\":\"keycloak.client.id\",\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}},{\"columnId\":\"61f135ec-ceba-4a82-9ddf-2795a8e1197a\",\"fieldName\":\"keycloak.login.redirect_uri\",\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}}],\"timeField\":\"@timestamp\",\"allColumns\":[{\"columnId\":\"@timestamp\",\"fieldName\":\"@timestamp\",\"meta\":{\"type\":\"date\",\"esType\":\"date\"},\"inMetricDimension\":true},{\"columnId\":\"agent.ephemeral_id\",\"fieldName\":\"agent.ephemeral_id\",\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}},{\"columnId\":\"agent.id\",\"fieldName\":\"agent.id\",\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}},{\"columnId\":\"agent.name\",\"fieldName\":\"agent.name\",\"meta\":{\"type\":\"string\",\"esType\":\"keyword\"}},{\"columnId\":\"agent.name.text\",\"fieldName\":\"agent.name.text\",\"meta\":{\"type\":\"string\",\"esType\":\"text\"}}]}},\"indexPatternRefs\":[{\"id\":\"1c4eead0a28b72819bd16e7da543f189ff498e9a967807a8cd96f7cbf8090fe9\",\"title\":\"logs-keycloak.log-default\",\"timeField\":\"@timestamp\"}]}},\"filters\":[],\"query\":{\"esql\":\"FROM logs-keycloak.log-default | WHERE keycloak.event_type LIKE \\\"login\\\" and keycloak.login.type != \\\"CODE_TO_TOKEN\\\" | KEEP *\"},\"visualization\":{\"layerId\":\"c5c9ef16-a818-45b2-a4ed-aa757fae5c5d\",\"layerType\":\"data\",\"columns\":[{\"columnId\":\"@timestamp\",\"width\":226.41071428571428},{\"columnId\":\"defe418a-b820-4218-9a92-a4d6c16d8c02\",\"isTransposed\":false,\"isMetric\":false,\"width\":139.92857142857144},{\"columnId\":\"baec0fb5-9ad5-424b-88de-0a5d8095ded9\",\"isTransposed\":false,\"isMetric\":false,\"width\":123.42857142857142},{\"columnId\":\"34a9ad1f-14de-45b3-acc5-13767b64864f\",\"isTransposed\":false,\"isMetric\":false,\"width\":207.80803571428572},{\"columnId\":\"61f135ec-ceba-4a82-9ddf-2795a8e1197a\",\"isTransposed\":false,\"isMetric\":false,\"hidden\":true},{\"columnId\":\"4ba25b75-4b89-4e13-b809-24b568acf993\",\"isTransposed\":false,\"isMetric\":false,\"width\":159.61607142857144},{\"columnId\":\"de144cd1-e33f-4814-8ede-d2558b81aeaf\",\"isTransposed\":false,\"isMetric\":false}]},\"adHocDataViews\":{\"1c4eead0a28b72819bd16e7da543f189ff498e9a967807a8cd96f7cbf8090fe9\":{\"id\":\"1c4eead0a28b72819bd16e7da543f189ff498e9a967807a8cd96f7cbf8090fe9\",\"title\":\"logs-keycloak.log-default\",\"timeFieldName\":\"@timestamp\",\"sourceFilters\":[],\"type\":\"esql\",\"fieldFormats\":{},\"runtimeFieldMap\":{},\"allowNoIndex\":false,\"name\":\"logs-keycloak.log-default\",\"allowHidden\":false}}},\"visualizationType\":\"lnsDatatable\",\"type\":\"lens\"},\"disabledActions\":[\"OPEN_FLYOUT_ADD_DRILLDOWN\"],\"enhancements\":{}},\"panelIndex\":\"4534d2e9-5e40-4cb2-bdb6-80900881eed0\",\"gridData\":{\"x\":0,\"y\":0,\"w\":26,\"h\":18,\"i\":\"4534d2e9-5e40-4cb2-bdb6-80900881eed0\"}},{\"type\":\"lens\",\"title\":\"Most tried usernames\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"references\":[{\"id\":\"logs-*\",\"name\":\"indexpattern-datasource-layer-94b09d4c-fe2f-40b4-8c83-986af491e122\",\"type\":\"index-pattern\"}],\"state\":{\"visualization\":{\"shape\":\"donut\",\"layers\":[{\"layerId\":\"94b09d4c-fe2f-40b4-8c83-986af491e122\",\"primaryGroups\":[\"c7ab7245-d225-42f0-9654-dd5b9c82bf0a\"],\"metrics\":[\"127ad25c-3c44-45dc-8422-d3a442b4048a\"],\"numberDisplay\":\"value\",\"categoryDisplay\":\"inside\",\"legendDisplay\":\"show\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rule\":{\"type\":\"other\"},\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"elastic_brand_2023\",\"colorMode\":{\"type\":\"categorical\"}},\"emptySizeRatio\":0.54,\"legendMaxLines\":1,\"percentDecimals\":2,\"legendSize\":\"small\"}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[],\"datasourceStates\":{\"formBased\":{\"layers\":{\"94b09d4c-fe2f-40b4-8c83-986af491e122\":{\"columns\":{\"c7ab7245-d225-42f0-9654-dd5b9c82bf0a\":{\"label\":\"Top 5 values of user.name\",\"dataType\":\"string\",\"operationType\":\"terms\",\"scale\":\"ordinal\",\"sourceField\":\"user.name\",\"isBucketed\":true,\"params\":{\"size\":5,\"orderBy\":{\"type\":\"column\",\"columnId\":\"127ad25c-3c44-45dc-8422-d3a442b4048a\"},\"orderDirection\":\"desc\",\"otherBucket\":true,\"missingBucket\":false,\"parentFormat\":{\"id\":\"terms\"},\"include\":[],\"exclude\":[],\"includeIsRegex\":false,\"excludeIsRegex\":false}},\"127ad25c-3c44-45dc-8422-d3a442b4048a\":{\"label\":\"Count of records\",\"dataType\":\"number\",\"operationType\":\"count\",\"isBucketed\":false,\"scale\":\"ratio\",\"sourceField\":\"___records___\",\"params\":{\"emptyAsNull\":true}}},\"columnOrder\":[\"c7ab7245-d225-42f0-9654-dd5b9c82bf0a\",\"127ad25c-3c44-45dc-8422-d3a442b4048a\"],\"incompleteColumns\":{},\"sampling\":1,\"indexPatternId\":\"logs-*\"}},\"currentIndexPatternId\":\"logs-*\"},\"indexpattern\":{\"layers\":{}},\"textBased\":{\"layers\":{}}},\"internalReferences\":[],\"adHocDataViews\":{}}},\"enhancements\":{}},\"panelIndex\":\"4c74739e-1aba-414f-ab1f-0513a486413d\",\"gridData\":{\"x\":26,\"y\":0,\"w\":9,\"h\":8,\"i\":\"4c74739e-1aba-414f-ab1f-0513a486413d\"}},{\"type\":\"lens\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[{\"id\":\"logs-*\",\"name\":\"indexpattern-datasource-layer-759f46de-bb02-483e-91a6-eb20d5f9f77e\",\"type\":\"index-pattern\"}],\"state\":{\"visualization\":{\"layerId\":\"759f46de-bb02-483e-91a6-eb20d5f9f77e\",\"layerType\":\"data\",\"valuesTextAlign\":\"right\",\"valueFontMode\":\"fit\",\"titlesTextAlign\":\"center\",\"subtitle\":\"\",\"icon\":\"alert\",\"metricAccessor\":\"011e46f8-ba48-4da5-a7bf-3bbe43c0e18d\",\"color\":\"#ffd6b9\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[{\"meta\":{\"index\":\"6b316564-22bf-4ed2-b0e1-7c27aee1017a\",\"type\":\"phrase\",\"key\":\"keycloak.event_type\",\"params\":{\"query\":\"login\"},\"disabled\":false,\"negate\":false,\"alias\":null},\"query\":{\"match_phrase\":{\"keycloak.event_type\":\"login\"}},\"$state\":{\"store\":\"appState\"}}],\"datasourceStates\":{\"formBased\":{\"layers\":{\"759f46de-bb02-483e-91a6-eb20d5f9f77e\":{\"columns\":{\"011e46f8-ba48-4da5-a7bf-3bbe43c0e18d\":{\"label\":\"Wrong username\",\"dataType\":\"number\",\"operationType\":\"count\",\"isBucketed\":false,\"scale\":\"ratio\",\"sourceField\":\"event.code\",\"filter\":{\"query\":\"event.code:\\\"user_not_found\\\"  \",\"language\":\"kuery\"},\"params\":{\"emptyAsNull\":true},\"customLabel\":true}},\"columnOrder\":[\"011e46f8-ba48-4da5-a7bf-3bbe43c0e18d\"],\"incompleteColumns\":{},\"sampling\":1,\"indexPatternId\":\"logs-*\"}},\"currentIndexPatternId\":\"logs-*\"},\"indexpattern\":{\"layers\":{}},\"textBased\":{\"layers\":{}}},\"internalReferences\":[],\"adHocDataViews\":{}}},\"enhancements\":{}},\"panelIndex\":\"5d9f096f-6f9c-435d-9a53-f2bdbe51f44e\",\"gridData\":{\"x\":35,\"y\":0,\"w\":4,\"h\":4,\"i\":\"5d9f096f-6f9c-435d-9a53-f2bdbe51f44e\"}},{\"type\":\"lens\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[{\"type\":\"index-pattern\",\"id\":\"logs-*\",\"name\":\"indexpattern-datasource-layer-759f46de-bb02-483e-91a6-eb20d5f9f77e\"}],\"state\":{\"visualization\":{\"layerId\":\"759f46de-bb02-483e-91a6-eb20d5f9f77e\",\"layerType\":\"data\",\"valuesTextAlign\":\"right\",\"valueFontMode\":\"fit\",\"titlesTextAlign\":\"center\",\"subtitle\":\"\",\"icon\":\"alert\",\"metricAccessor\":\"011e46f8-ba48-4da5-a7bf-3bbe43c0e18d\",\"color\":\"#ffb9b9\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[{\"meta\":{\"index\":\"6b316564-22bf-4ed2-b0e1-7c27aee1017a\",\"type\":\"phrase\",\"key\":\"keycloak.event_type\",\"params\":{\"query\":\"login\"},\"disabled\":false,\"negate\":false,\"alias\":null},\"query\":{\"match_phrase\":{\"keycloak.event_type\":\"login\"}},\"$state\":{\"store\":\"appState\"}}],\"datasourceStates\":{\"formBased\":{\"layers\":{\"759f46de-bb02-483e-91a6-eb20d5f9f77e\":{\"columns\":{\"011e46f8-ba48-4da5-a7bf-3bbe43c0e18d\":{\"label\":\"Wrong password\",\"dataType\":\"number\",\"operationType\":\"count\",\"isBucketed\":false,\"scale\":\"ratio\",\"sourceField\":\"event.code\",\"filter\":{\"query\":\"event.code:\\\"invalid_user_credentials\\\" \",\"language\":\"kuery\"},\"params\":{\"emptyAsNull\":true},\"customLabel\":true}},\"columnOrder\":[\"011e46f8-ba48-4da5-a7bf-3bbe43c0e18d\"],\"incompleteColumns\":{},\"sampling\":1}}},\"indexpattern\":{\"layers\":{}},\"textBased\":{\"layers\":{}}},\"internalReferences\":[],\"adHocDataViews\":{}}},\"enhancements\":{}},\"panelIndex\":\"37683b53-a3d5-4afb-ae8c-c492caa25a5e\",\"gridData\":{\"x\":39,\"y\":0,\"w\":4,\"h\":4,\"i\":\"37683b53-a3d5-4afb-ae8c-c492caa25a5e\"}},{\"type\":\"lens\",\"title\":\"LOGS (last 24h)\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"references\":[{\"id\":\"logs-*\",\"name\":\"indexpattern-datasource-layer-759f46de-bb02-483e-91a6-eb20d5f9f77e\",\"type\":\"index-pattern\"}],\"state\":{\"visualization\":{\"shape\":\"donut\",\"layers\":[{\"layerId\":\"759f46de-bb02-483e-91a6-eb20d5f9f77e\",\"primaryGroups\":[\"4d43c6fa-a59b-453a-ada1-b0fc37221ea7\"],\"metrics\":[\"23dc4f8d-8b99-4aa5-917d-5432b345c259\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"inside\",\"legendDisplay\":\"default\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[{\"rule\":{\"type\":\"matchExactly\",\"values\":[\"LOGIN_ERROR\"]},\"color\":{\"type\":\"categorical\",\"paletteId\":\"eui_amsterdam_color_blind\",\"colorIndex\":9},\"touched\":true},{\"rule\":{\"type\":\"matchExactly\",\"values\":[\"LOGOUT_ERROR\"]},\"color\":{\"type\":\"categorical\",\"paletteId\":\"neutral\",\"colorIndex\":2},\"touched\":true},{\"rule\":{\"type\":\"matchExactly\",\"values\":[\"LOGIN\"]},\"color\":{\"type\":\"categorical\",\"paletteId\":\"eui_amsterdam_color_blind\",\"colorIndex\":0},\"touched\":true},{\"rule\":{\"type\":\"matchExactly\",\"values\":[\"CODE_TO_TOKEN\"]},\"color\":{\"type\":\"categorical\",\"paletteId\":\"eui_amsterdam_color_blind\",\"colorIndex\":8},\"touched\":true}],\"specialAssignments\":[{\"rule\":{\"type\":\"other\"},\"color\":{\"type\":\"loop\"},\"touched\":false}],\"paletteId\":\"eui_amsterdam_color_blind\",\"colorMode\":{\"type\":\"categorical\"}},\"emptySizeRatio\":0.54}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[{\"meta\":{\"index\":\"29df1a41-2e9c-43cc-be03-563c535a8b88\",\"type\":\"phrase\",\"key\":\"keycloak.event_type\",\"params\":{\"query\":\"login\"},\"disabled\":false,\"negate\":false,\"alias\":null},\"query\":{\"match_phrase\":{\"keycloak.event_type\":\"login\"}},\"$state\":{\"store\":\"appState\"}}],\"datasourceStates\":{\"formBased\":{\"layers\":{\"759f46de-bb02-483e-91a6-eb20d5f9f77e\":{\"columns\":{\"23dc4f8d-8b99-4aa5-917d-5432b345c259\":{\"label\":\"last 24h\",\"dataType\":\"number\",\"operationType\":\"count\",\"isBucketed\":false,\"scale\":\"ratio\",\"sourceField\":\"___records___\",\"reducedTimeRange\":\"24h\",\"params\":{\"emptyAsNull\":true,\"format\":{\"id\":\"number\",\"params\":{\"decimals\":0,\"compact\":true,\"suffix\":\" logs\"}}},\"customLabel\":true,\"filter\":{\"query\":\"keycloak.login.type : \\\"LOGIN\\\"  or keycloak.login.type : \\\"LOGIN_ERROR\\\"  or keycloak.login.type : \\\"LOGOUT_ERROR\\\" \",\"language\":\"kuery\"}},\"4d43c6fa-a59b-453a-ada1-b0fc37221ea7\":{\"label\":\"Top 5 values of keycloak.login.type\",\"dataType\":\"string\",\"operationType\":\"terms\",\"scale\":\"ordinal\",\"sourceField\":\"keycloak.login.type\",\"isBucketed\":true,\"params\":{\"size\":5,\"orderBy\":{\"type\":\"column\",\"columnId\":\"23dc4f8d-8b99-4aa5-917d-5432b345c259\"},\"orderDirection\":\"desc\",\"otherBucket\":true,\"missingBucket\":false,\"parentFormat\":{\"id\":\"terms\"},\"include\":[],\"exclude\":[],\"includeIsRegex\":false,\"excludeIsRegex\":false}}},\"columnOrder\":[\"4d43c6fa-a59b-453a-ada1-b0fc37221ea7\",\"23dc4f8d-8b99-4aa5-917d-5432b345c259\"],\"incompleteColumns\":{},\"sampling\":1,\"indexPatternId\":\"logs-*\"}},\"currentIndexPatternId\":\"logs-*\"},\"indexpattern\":{\"layers\":{}},\"textBased\":{\"layers\":{}}},\"internalReferences\":[],\"adHocDataViews\":{}}},\"enhancements\":{}},\"panelIndex\":\"dab5afb4-546f-4eb8-9ad8-c2fb754858b8\",\"gridData\":{\"x\":43,\"y\":0,\"w\":5,\"h\":8,\"i\":\"dab5afb4-546f-4eb8-9ad8-c2fb754858b8\"}},{\"type\":\"lens\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"visualizationType\":\"lnsMetric\",\"type\":\"lens\",\"references\":[{\"id\":\"logs-*\",\"name\":\"indexpattern-datasource-layer-759f46de-bb02-483e-91a6-eb20d5f9f77e\",\"type\":\"index-pattern\"}],\"state\":{\"visualization\":{\"layerId\":\"759f46de-bb02-483e-91a6-eb20d5f9f77e\",\"layerType\":\"data\",\"metricAccessor\":\"23dc4f8d-8b99-4aa5-917d-5432b345c259\",\"valuesTextAlign\":\"right\",\"valueFontMode\":\"fit\",\"titlesTextAlign\":\"center\",\"subtitle\":\"\",\"color\":\"#acefa0\",\"icon\":\"starEmpty\"},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[{\"meta\":{\"index\":\"6b316564-22bf-4ed2-b0e1-7c27aee1017a\",\"type\":\"phrase\",\"key\":\"keycloak.event_type\",\"params\":{\"query\":\"login\"},\"disabled\":false,\"negate\":false,\"alias\":null},\"query\":{\"match_phrase\":{\"keycloak.event_type\":\"login\"}},\"$state\":{\"store\":\"appState\"}}],\"datasourceStates\":{\"formBased\":{\"layers\":{\"759f46de-bb02-483e-91a6-eb20d5f9f77e\":{\"columns\":{\"23dc4f8d-8b99-4aa5-917d-5432b345c259\":{\"label\":\"successful logins (last 24h)\",\"dataType\":\"number\",\"operationType\":\"count\",\"isBucketed\":false,\"scale\":\"ratio\",\"sourceField\":\"___records___\",\"reducedTimeRange\":\"24h\",\"params\":{\"emptyAsNull\":false,\"format\":{\"id\":\"number\",\"params\":{\"decimals\":0,\"compact\":true,\"suffix\":\" logs\"}}},\"customLabel\":true,\"filter\":{\"query\":\"keycloak.login.type : \\\"LOGIN\\\" \",\"language\":\"kuery\"}}},\"columnOrder\":[\"23dc4f8d-8b99-4aa5-917d-5432b345c259\"],\"incompleteColumns\":{},\"sampling\":1,\"indexPatternId\":\"logs-*\"}},\"currentIndexPatternId\":\"logs-*\"},\"indexpattern\":{\"layers\":{}},\"textBased\":{\"layers\":{}}},\"internalReferences\":[],\"adHocDataViews\":{}}},\"enhancements\":{}},\"panelIndex\":\"4b9a78dc-8c13-4ecd-ba71-aa37244225f9\",\"gridData\":{\"x\":35,\"y\":4,\"w\":8,\"h\":4,\"i\":\"4b9a78dc-8c13-4ecd-ba71-aa37244225f9\"}},{\"type\":\"lens\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"visualizationType\":\"lnsDatatable\",\"type\":\"lens\",\"references\":[{\"type\":\"index-pattern\",\"id\":\"logs-*\",\"name\":\"indexpattern-datasource-layer-b22eb5a7-1f0b-41dd-a932-d845e6098a37\"}],\"state\":{\"visualization\":{\"layerId\":\"b22eb5a7-1f0b-41dd-a932-d845e6098a37\",\"layerType\":\"data\",\"columns\":[{\"columnId\":\"badf754a-5eec-4f3a-bb58-d63d3fe3f98e\"},{\"columnId\":\"87afe65f-261e-4fcb-a1a7-e584f9d8bfc8\"},{\"columnId\":\"bc10b773-757f-445e-94cb-5dd0808af3ab\",\"isTransposed\":false,\"isMetric\":false}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[],\"datasourceStates\":{\"formBased\":{\"layers\":{\"b22eb5a7-1f0b-41dd-a932-d845e6098a37\":{\"columns\":{\"badf754a-5eec-4f3a-bb58-d63d3fe3f98e\":{\"label\":\"Top 5 values of url.original\",\"dataType\":\"string\",\"operationType\":\"terms\",\"scale\":\"ordinal\",\"sourceField\":\"url.original\",\"isBucketed\":true,\"params\":{\"size\":5,\"orderBy\":{\"type\":\"column\",\"columnId\":\"87afe65f-261e-4fcb-a1a7-e584f9d8bfc8\"},\"orderDirection\":\"desc\",\"otherBucket\":true,\"missingBucket\":false,\"parentFormat\":{\"id\":\"terms\"},\"include\":[\"/critical\"],\"exclude\":[],\"includeIsRegex\":false,\"excludeIsRegex\":false}},\"87afe65f-261e-4fcb-a1a7-e584f9d8bfc8\":{\"label\":\"Count of records\",\"dataType\":\"number\",\"operationType\":\"count\",\"isBucketed\":false,\"scale\":\"ratio\",\"sourceField\":\"___records___\",\"params\":{\"emptyAsNull\":true}},\"bc10b773-757f-445e-94cb-5dd0808af3ab\":{\"label\":\"Top 3 values of source.ip\",\"dataType\":\"ip\",\"operationType\":\"terms\",\"scale\":\"ordinal\",\"sourceField\":\"source.ip\",\"isBucketed\":true,\"params\":{\"size\":3,\"orderBy\":{\"type\":\"column\",\"columnId\":\"87afe65f-261e-4fcb-a1a7-e584f9d8bfc8\"},\"orderDirection\":\"desc\",\"otherBucket\":true,\"missingBucket\":false,\"parentFormat\":{\"id\":\"terms\"},\"include\":[],\"exclude\":[],\"includeIsRegex\":false,\"excludeIsRegex\":false}}},\"columnOrder\":[\"badf754a-5eec-4f3a-bb58-d63d3fe3f98e\",\"bc10b773-757f-445e-94cb-5dd0808af3ab\",\"87afe65f-261e-4fcb-a1a7-e584f9d8bfc8\"],\"incompleteColumns\":{},\"sampling\":1}}},\"indexpattern\":{\"layers\":{}},\"textBased\":{\"layers\":{}}},\"internalReferences\":[],\"adHocDataViews\":{}}},\"enhancements\":{}},\"panelIndex\":\"84f5edf5-838b-42ab-ae27-15bb0b91ce97\",\"gridData\":{\"x\":26,\"y\":8,\"w\":12,\"h\":10,\"i\":\"84f5edf5-838b-42ab-ae27-15bb0b91ce97\"}},{\"type\":\"lens\",\"title\":\"Most accessed applications\",\"embeddableConfig\":{\"attributes\":{\"title\":\"\",\"visualizationType\":\"lnsPie\",\"type\":\"lens\",\"references\":[{\"id\":\"logs-*\",\"name\":\"indexpattern-datasource-layer-10e7b198-025c-46fb-8bdc-629e2027ee8e\",\"type\":\"index-pattern\"}],\"state\":{\"visualization\":{\"shape\":\"donut\",\"layers\":[{\"layerId\":\"10e7b198-025c-46fb-8bdc-629e2027ee8e\",\"primaryGroups\":[\"62cf0b82-0e07-487e-8943-f8c16b58abcb\"],\"metrics\":[\"f7ca7421-35d6-4fcb-9eff-602b4b2be759\"],\"numberDisplay\":\"percent\",\"categoryDisplay\":\"default\",\"legendDisplay\":\"show\",\"nestedLegend\":false,\"layerType\":\"data\",\"colorMapping\":{\"assignments\":[],\"specialAssignments\":[{\"rule\":{\"type\":\"other\"},\"color\":{\"type\":\"loop\"},\"touched\":true}],\"paletteId\":\"kibana_v7_legacy\",\"colorMode\":{\"type\":\"gradient\",\"steps\":[{\"type\":\"categorical\",\"paletteId\":\"kibana_v7_legacy\",\"colorIndex\":0,\"touched\":false}],\"sort\":\"desc\"}},\"emptySizeRatio\":0.54}]},\"query\":{\"query\":\"\",\"language\":\"kuery\"},\"filters\":[],\"datasourceStates\":{\"formBased\":{\"layers\":{\"10e7b198-025c-46fb-8bdc-629e2027ee8e\":{\"columns\":{\"62cf0b82-0e07-487e-8943-f8c16b58abcb\":{\"label\":\"client\",\"dataType\":\"string\",\"operationType\":\"terms\",\"scale\":\"ordinal\",\"sourceField\":\"keycloak.client.id\",\"isBucketed\":true,\"params\":{\"size\":5,\"orderBy\":{\"type\":\"column\",\"columnId\":\"f7ca7421-35d6-4fcb-9eff-602b4b2be759\"},\"orderDirection\":\"desc\",\"otherBucket\":true,\"missingBucket\":false,\"parentFormat\":{\"id\":\"terms\"},\"include\":[],\"exclude\":[],\"includeIsRegex\":false,\"excludeIsRegex\":false},\"customLabel\":true},\"f7ca7421-35d6-4fcb-9eff-602b4b2be759\":{\"label\":\"Count of records\",\"dataType\":\"number\",\"operationType\":\"count\",\"isBucketed\":false,\"scale\":\"ratio\",\"sourceField\":\"___records___\",\"filter\":{\"query\":\"keycloak.event_type : \\\"login\\\" \",\"language\":\"kuery\"},\"params\":{\"emptyAsNull\":true}}},\"columnOrder\":[\"62cf0b82-0e07-487e-8943-f8c16b58abcb\",\"f7ca7421-35d6-4fcb-9eff-602b4b2be759\"],\"incompleteColumns\":{},\"sampling\":1,\"indexPatternId\":\"logs-*\"}},\"currentIndexPatternId\":\"logs-*\"},\"indexpattern\":{\"layers\":{}},\"textBased\":{\"layers\":{}}},\"internalReferences\":[],\"adHocDataViews\":{}}},\"enhancements\":{}},\"panelIndex\":\"092631dd-f510-4e01-a383-e28db38f3c51\",\"gridData\":{\"x\":38,\"y\":8,\"w\":10,\"h\":10,\"i\":\"092631dd-f510-4e01-a383-e28db38f3c51\"}},{\"type\":\"map\",\"embeddableConfig\":{\"hiddenLayers\":[],\"isLayerTOCOpen\":false,\"mapCenter\":{\"lon\":-42.4844,\"lat\":31.82733,\"zoom\":2.08},\"openTOCDetails\":[],\"attributes\":{\"title\":\"\",\"description\":\"\",\"layerListJSON\":\"[{\\\"locale\\\":\\\"autoselect\\\",\\\"sourceDescriptor\\\":{\\\"type\\\":\\\"EMS_TMS\\\",\\\"id\\\":\\\"dark_map\\\",\\\"isAutoSelect\\\":false,\\\"lightModeDefault\\\":\\\"road_map_desaturated\\\"},\\\"id\\\":\\\"d537461a-6040-4c6b-91e4-7d8a1ed72450\\\",\\\"label\\\":null,\\\"minZoom\\\":0,\\\"maxZoom\\\":24,\\\"alpha\\\":1,\\\"visible\\\":true,\\\"style\\\":{\\\"type\\\":\\\"EMS_VECTOR_TILE\\\",\\\"color\\\":\\\"#83907A\\\"},\\\"includeInFitToBounds\\\":true,\\\"type\\\":\\\"EMS_VECTOR_TILE\\\"},{\\\"sourceDescriptor\\\":{\\\"geoField\\\":\\\"source.geo.location\\\",\\\"scalingType\\\":\\\"MVT\\\",\\\"id\\\":\\\"8c034217-788a-4cfb-90da-2b5e25f1d32f\\\",\\\"type\\\":\\\"ES_SEARCH\\\",\\\"applyGlobalQuery\\\":true,\\\"applyGlobalTime\\\":true,\\\"applyForceRefresh\\\":true,\\\"filterByMapBounds\\\":true,\\\"tooltipProperties\\\":[],\\\"sortField\\\":\\\"\\\",\\\"sortOrder\\\":\\\"desc\\\",\\\"topHitsGroupByTimeseries\\\":false,\\\"topHitsSplitField\\\":\\\"\\\",\\\"topHitsSize\\\":1,\\\"indexPatternRefName\\\":\\\"layer_1_source_index_pattern\\\"},\\\"id\\\":\\\"def98706-fba0-4b3d-9fc4-b9c941a55a53\\\",\\\"label\\\":null,\\\"minZoom\\\":0,\\\"maxZoom\\\":24,\\\"alpha\\\":0.75,\\\"visible\\\":true,\\\"style\\\":{\\\"type\\\":\\\"VECTOR\\\",\\\"properties\\\":{\\\"icon\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"value\\\":\\\"danger\\\"}},\\\"fillColor\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"color\\\":\\\"#c61b1b\\\"}},\\\"lineColor\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"color\\\":\\\"#41937c\\\"}},\\\"lineWidth\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"size\\\":0}},\\\"iconSize\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"size\\\":6}},\\\"iconOrientation\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"orientation\\\":0}},\\\"labelText\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"value\\\":\\\"Login error\\\"}},\\\"labelColor\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"color\\\":\\\"#ff0000\\\"}},\\\"labelSize\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"size\\\":10}},\\\"labelZoomRange\\\":{\\\"options\\\":{\\\"useLayerZoomRange\\\":true,\\\"minZoom\\\":0,\\\"maxZoom\\\":24}},\\\"labelBorderColor\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"color\\\":\\\"#FFFFFF\\\"}},\\\"symbolizeAs\\\":{\\\"options\\\":{\\\"value\\\":\\\"icon\\\"}},\\\"labelBorderSize\\\":{\\\"options\\\":{\\\"size\\\":\\\"NONE\\\"}},\\\"labelPosition\\\":{\\\"options\\\":{\\\"position\\\":\\\"BOTTOM\\\"}}},\\\"isTimeAware\\\":true},\\\"includeInFitToBounds\\\":true,\\\"type\\\":\\\"MVT_VECTOR\\\",\\\"joins\\\":[],\\\"disableTooltips\\\":false,\\\"query\\\":{\\\"query\\\":\\\"keycloak.login.type : \\\\\\\"LOGIN_ERROR\\\\\\\" \\\",\\\"language\\\":\\\"kuery\\\"}},{\\\"sourceDescriptor\\\":{\\\"geoField\\\":\\\"source.geo.location\\\",\\\"scalingType\\\":\\\"MVT\\\",\\\"id\\\":\\\"2f1eeb8d-51ac-4e38-b1fe-fe5dfc970df2\\\",\\\"type\\\":\\\"ES_SEARCH\\\",\\\"applyGlobalQuery\\\":true,\\\"applyGlobalTime\\\":true,\\\"applyForceRefresh\\\":true,\\\"filterByMapBounds\\\":true,\\\"tooltipProperties\\\":[],\\\"sortField\\\":\\\"\\\",\\\"sortOrder\\\":\\\"desc\\\",\\\"topHitsGroupByTimeseries\\\":false,\\\"topHitsSplitField\\\":\\\"\\\",\\\"topHitsSize\\\":1,\\\"indexPatternRefName\\\":\\\"layer_2_source_index_pattern\\\"},\\\"id\\\":\\\"bd6b11a6-f1a3-429d-b73a-b319cd88f03a\\\",\\\"label\\\":null,\\\"minZoom\\\":0,\\\"maxZoom\\\":24,\\\"alpha\\\":0.75,\\\"visible\\\":true,\\\"style\\\":{\\\"type\\\":\\\"VECTOR\\\",\\\"properties\\\":{\\\"icon\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"value\\\":\\\"marker\\\"}},\\\"fillColor\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"color\\\":\\\"#54B399\\\"}},\\\"lineColor\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"color\\\":\\\"#41937c\\\"}},\\\"lineWidth\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"size\\\":0}},\\\"iconSize\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"size\\\":4}},\\\"iconOrientation\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"orientation\\\":0}},\\\"labelText\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"value\\\":\\\"Login success\\\"}},\\\"labelColor\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"color\\\":\\\"#10eeb1\\\"}},\\\"labelSize\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"size\\\":10}},\\\"labelZoomRange\\\":{\\\"options\\\":{\\\"useLayerZoomRange\\\":true,\\\"minZoom\\\":0,\\\"maxZoom\\\":24}},\\\"labelBorderColor\\\":{\\\"type\\\":\\\"STATIC\\\",\\\"options\\\":{\\\"color\\\":\\\"#FFFFFF\\\"}},\\\"symbolizeAs\\\":{\\\"options\\\":{\\\"value\\\":\\\"circle\\\"}},\\\"labelBorderSize\\\":{\\\"options\\\":{\\\"size\\\":\\\"NONE\\\"}},\\\"labelPosition\\\":{\\\"options\\\":{\\\"position\\\":\\\"TOP\\\"}}},\\\"isTimeAware\\\":true},\\\"includeInFitToBounds\\\":true,\\\"type\\\":\\\"MVT_VECTOR\\\",\\\"joins\\\":[],\\\"disableTooltips\\\":false,\\\"query\\\":{\\\"query\\\":\\\"keycloak.login.type : \\\\\\\"LOGIN\\\\\\\"  \\\",\\\"language\\\":\\\"kuery\\\"}}]\",\"mapStateJSON\":\"{\\\"adHocDataViews\\\":[],\\\"zoom\\\":2.08,\\\"center\\\":{\\\"lon\\\":-23.52629,\\\"lat\\\":13.84299},\\\"timeFilters\\\":{\\\"from\\\":\\\"2025-04-13T19:10:29.761Z\\\",\\\"to\\\":\\\"now\\\"},\\\"refreshConfig\\\":{\\\"isPaused\\\":true,\\\"interval\\\":60000},\\\"query\\\":{\\\"query\\\":\\\"\\\",\\\"language\\\":\\\"kuery\\\"},\\\"filters\\\":[],\\\"settings\\\":{\\\"autoFitToDataBounds\\\":false,\\\"backgroundColor\\\":\\\"#ffffff\\\",\\\"customIcons\\\":[],\\\"disableInteractive\\\":false,\\\"disableTooltipControl\\\":false,\\\"hideToolbarOverlay\\\":false,\\\"hideLayerControl\\\":false,\\\"hideViewControl\\\":false,\\\"initialLocation\\\":\\\"LAST_SAVED_LOCATION\\\",\\\"fixedLocation\\\":{\\\"lat\\\":0,\\\"lon\\\":0,\\\"zoom\\\":2},\\\"browserLocation\\\":{\\\"zoom\\\":2},\\\"keydownScrollZoom\\\":false,\\\"maxZoom\\\":24,\\\"minZoom\\\":0,\\\"showScaleControl\\\":false,\\\"showSpatialFilters\\\":true,\\\"showTimesliderToggleButton\\\":true,\\\"spatialFiltersAlpa\\\":0.3,\\\"spatialFiltersFillColor\\\":\\\"#DA8B45\\\",\\\"spatialFiltersLineColor\\\":\\\"#DA8B45\\\"}}\",\"uiStateJSON\":\"{\\\"isLayerTOCOpen\\\":true,\\\"openTOCDetails\\\":[]}\"},\"enhancements\":{\"dynamicActions\":{\"events\":[]}},\"mapBuffer\":{\"minLon\":-225,\"minLat\":0,\"maxLon\":135,\"maxLat\":66.51326}},\"panelIndex\":\"b43cb38f-9741-4d6d-8114-bb5532c5e495\",\"gridData\":{\"x\":0,\"y\":18,\"w\":48,\"h\":11,\"i\":\"b43cb38f-9741-4d6d-8114-bb5532c5e495\"}}]","timeRestore":false,"title":"M_Dashboard_final","version":3},"coreMigrationVersion":"8.8.0","created_at":"2025-05-09T17:26:54.988Z","created_by":"u_mGBROF_q5bmFCATbLXAcCwKa0k8JvONAwSruelyKA5E_0","id":"e71cd279-01dc-4db9-b1b8-6342e8e54199","managed":false,"references":[{"id":"logs-*","name":"4c74739e-1aba-414f-ab1f-0513a486413d:indexpattern-datasource-layer-94b09d4c-fe2f-40b4-8c83-986af491e122","type":"index-pattern"},{"id":"logs-*","name":"5d9f096f-6f9c-435d-9a53-f2bdbe51f44e:indexpattern-datasource-layer-759f46de-bb02-483e-91a6-eb20d5f9f77e","type":"index-pattern"},{"id":"logs-*","name":"37683b53-a3d5-4afb-ae8c-c492caa25a5e:indexpattern-datasource-layer-759f46de-bb02-483e-91a6-eb20d5f9f77e","type":"index-pattern"},{"id":"logs-*","name":"dab5afb4-546f-4eb8-9ad8-c2fb754858b8:indexpattern-datasource-layer-759f46de-bb02-483e-91a6-eb20d5f9f77e","type":"index-pattern"},{"id":"logs-*","name":"4b9a78dc-8c13-4ecd-ba71-aa37244225f9:indexpattern-datasource-layer-759f46de-bb02-483e-91a6-eb20d5f9f77e","type":"index-pattern"},{"id":"logs-*","name":"84f5edf5-838b-42ab-ae27-15bb0b91ce97:indexpattern-datasource-layer-b22eb5a7-1f0b-41dd-a932-d845e6098a37","type":"index-pattern"},{"id":"logs-*","name":"092631dd-f510-4e01-a383-e28db38f3c51:indexpattern-datasource-layer-10e7b198-025c-46fb-8bdc-629e2027ee8e","type":"index-pattern"},{"id":"logs-*","name":"b43cb38f-9741-4d6d-8114-bb5532c5e495:layer_1_source_index_pattern","type":"index-pattern"},{"id":"logs-*","name":"b43cb38f-9741-4d6d-8114-bb5532c5e495:layer_2_source_index_pattern","type":"index-pattern"}],"type":"dashboard","typeMigrationVersion":"10.2.0","updated_at":"2025-05-09T17:26:54.988Z","updated_by":"u_mGBROF_q5bmFCATbLXAcCwKa0k8JvONAwSruelyKA5E_0","version":"WzMyNzIsNDNd"}
{"excludedObjects":[],"excludedObjectsCount":0,"exportedCount":2,"missingRefCount":0,"missingReferences":[]}